Server/Example/C/gcc_mpi_omp/windAroundBuildings_v2206/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          494;
        startFace       558513;
    }
    outlet
    {
        type            patch;
        nFaces          200;
        startFace       559007;
    }
    ground
    {
        type            wall;
        inGroups        1(wall);
        nFaces          6310;
        startFace       559207;
    }
    frontAndBack
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          1000;
        startFace       565517;
    }
    buildings
    {
        type            wall;
        inGroups        1(wall);
        nFaces          22721;
        startFace       566517;
    }
)

// ************************************************************************* //
